In [38]:
import pandas as pd

In [39]:
df= pd.read_excel('https://github.com/chris78rey/DIPLOM_BIGDATA/blob/main/DATOS_PRUEBA.xlsx?raw=true')

In [40]:
df

     CATEGORIA  VALOR  VALOR 2           Date&Time
0        Item4   87.0    87.09 2021-08-01 18:07:20
1         Item   46.0    45.58 2021-08-01 21:02:37
2        Item5   84.0    84.28 2021-08-01 23:57:53
3        Item0   35.0    35.04 2021-08-02 02:53:10
4        Item2   10.0    10.25 2021-08-02 05:48:27
...        ...    ...      ...                 ...
2995     Item6   52.0    52.22 2022-08-01 07:26:13
2996      Item   89.0    88.94 2022-08-01 10:21:30
2997     Item3   16.0    15.70 2022-08-01 13:16:47
2998     Item1   12.0    11.84 2022-08-01 16:12:03
2999      Item   69.0    69.04 2022-08-01 19:07:20

[3000 rows x 4 columns]

In [41]:
df.reset_index

<bound method DataFrame.reset_index of      CATEGORIA  VALOR  VALOR 2           Date&Time
0        Item4   87.0    87.09 2021-08-01 18:07:20
1         Item   46.0    45.58 2021-08-01 21:02:37
2        Item5   84.0    84.28 2021-08-01 23:57:53
3        Item0   35.0    35.04 2021-08-02 02:53:10
4        Item2   10.0    10.25 2021-08-02 05:48:27
...        ...    ...      ...                 ...
2995     Item6   52.0    52.22 2022-08-01 07:26:13
2996      Item   89.0    88.94 2022-08-01 10:21:30
2997     Item3   16.0    15.70 2022-08-01 13:16:47
2998     Item1   12.0    11.84 2022-08-01 16:12:03
2999      Item   69.0    69.04 2022-08-01 19:07:20

[3000 rows x 4 columns]>

In [42]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3000 entries, 0 to 2999
Data columns (total 4 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   CATEGORIA  3000 non-null   object
 1   VALOR      2995 non-null   float64
 2   VALOR 2    2993 non-null   float64
 3   Date&Time  2999 non-null   datetime64[ns]
dtypes: datetime64[ns](1), float64(2), object(1)
memory usage: 93.9+ KB

In [43]:
new_var = df.groupby(['CATEGORIA'])
df_grupo_suma=new_var

In [44]:
dir(df_grupo_suma)

['CATEGORIA',
 'VALOR',
 '__annotations__',
 '__class__',
 '__class_getitem__',
 '__delattr__',
 '__dict__',
 '__dir__',
 '__doc__',
 '__eq__',
 '__format__',
 '__ge__',
 '__getattr__',
 '__getattribute__',
 '__getitem__',
 '__gt__',
 '__hash__',
 '__init__',
 '__init_subclass__',
 '__iter__',
 '__le__',
 '__len__',
 '__lt__',
 '__module__',
 '__ne__',
 '__new__',
 '__orig_bases__',
 '__parameters__',
 '__reduce__',
 '__reduce_ex__',
 '__repr__',
 '__setattr__',
 '__sizeof__',
 '__slots__',
 '__str__',
 '__subclasshook__',
 '__weakref__',
 '_accessors',
 '_agg_examples_doc',
 '_agg_general',
 '_agg_py_fallback',
 '_aggregate_frame',
 '_aggregate_item_by_item',
 '_aggregate_with_numba',
 '_apply_allowlist',
 '_apply_filter',
 '_apply_to_column_groupbys',
 '_ascending_count',
 '_bool_agg',
 '_can_use_transform_fast',
 '_choose_path',
 '_concat_objects',
 '_constructor',
 '_cumcount_array',
 '_cython_agg_general',
 '_cython_transform',
 '_define_paths',
 '_descending_count',
 '_dir_additions',
 '_dir_deletions',
 '_fill',
 '_get_cythonized_result',
 '_get_data_to_aggregate',
 '_get_index',
 '_get_indices',
 '_gotitem',
 '_group_selection',
 '_group_selection_context',
 '_hidden_attrs',
 '_indexed_output_to_ndframe',
 '_insert_inaxis_grouper_inplace',
 '_internal_names',
 '_internal_names_set',
 '_is_protocol',
 '_iterate_column_groupbys',
 '_iterate_slices',
 '_make_mask_from_int',
 '_make_mask_from_list',
 '_make_mask_from_positional_indexer',
 '_make_mask_from_slice',
 '_make_mask_from_tuple',
 '_make_wrapper',
 '_mask_selected_obj',
 '_numba_agg_general',
 '_numba_prep',
 '_obj_1d_constructor',
 '_obj_with_exclusions',
 '_positional_selector',
 '_python_agg_general',
 '_python_apply_general',
 '_reindex_output',
 '_reset_cache',
 '_reset_group_selection',
 '_resolve_numeric_only',
 '_selected_obj',
 '_selection',
 '_selection_list',
 '_set_group_selection',
 '_set_result_index_ordered',
 '_transform',
 '_transform_general',
 '_transform_item_by_item',
 '_transform_with_numba',
 '_wrap_agged_manager',
 '_wrap_aggregated_output',
 '_wrap_applied_output',
 '_wrap_applied_output_series',
 '_wrap_transform_fast_result',
 '_wrap_transformed_output',
 'agg',
 'aggregate',
 'all',
 'any',
 'apply',
 'backfill',
 'bfill',
 'boxplot',
 'corr',
 'corrwith',
 'count',
 'cov',
 'cumcount',
 'cummax',
 'cummin',
 'cumprod',
 'cumsum',
 'describe',
 'diff',
 'dtypes',
 'ewm',
 'expanding',
 'ffill',
 'fillna',
 'filter',
 'first',
 'get_group',
 'groups',
 'head',
 'hist',
 'idxmax',
 'idxmin',
 'indices',
 'last',
 'mad',
 'max',
 'mean',
 'median',
 'min',
 'ndim',
 'ngroup',
 'ngroups',
 'nth',
 'nunique',
 'ohlc',
 'pad',
 'pct_change',
 'pipe',
 'plot',
 'prod',
 'quantile',
 'rank',
 'resample',
 'rolling',
 'sample',
 'sem',
 'shift',
 'size',
 'skew',
 'std',
 'sum',
 'tail',
 'take',
 'transform',
 'tshift',
 'value_counts',
 'var']

In [45]:
df_grupo_suma.sum()

             VALOR   VALOR 2
CATEGORIA
Item       19706.0  19803.11
Item0      19236.0  19221.15
Item1      19691.0  19688.19
Item2      21397.0  21402.07
Item3      21539.0  21519.49
Item4      19795.0  19631.10
Item5      21729.0  21706.48
Item6      20778.0  20785.76

In [46]:
type(df_grupo_suma.sum())

pandas.core.frame.DataFrame

In [47]:
df2=df.describe()

In [48]:
df2

             VALOR      VALOR 2
count  2995.000000  2993.000000
mean     54.714858    54.713448
std      25.954102    25.948535
min      10.000000    10.010000
25%      32.000000    32.490000
50%      55.000000    54.660000
75%      77.000000    77.100000
max     100.000000    99.970000

In [49]:
df2.loc[['count','std'],'VALOR']

count    2995.000000
std        25.954102
Name: VALOR, dtype: float64

In [50]:
df3=df.T

In [51]:
df3

,0,1,2,3,4,5,6,7,8,9,...,2990,2991,2992,2993,2994,2995,2996,2997,2998,2999
CATEGORIA,Item4,Item,Item5,Item0,Item2,Item2,Item0,Item0,Item4,Item6,...,Item,Item3,Item,Item0,Item0,Item6,Item,Item3,Item1,Item
VALOR,87.0,46.0,84.0,35.0,10.0,89.0,59.0,58.0,83.0,68.0,...,92.0,73.0,31.0,24.0,71.0,52.0,89.0,16.0,12.0,69.0
VALOR 2,87.09,45.58,84.28,35.04,10.25,89.42,59.37,57.97,83.13,67.55,...,91.8,72.83,31.03,24.19,71.14,52.22,88.94,15.7,11.84,69.04
Date&Time,2021-08-01 18:07:20,2021-08-01 21:02:37,2021-08-01 23:57:53,2021-08-02 02:53:10,2021-08-02 05:48:27,2021-08-02 08:43:44,2021-08-02 11:39:00,2021-08-02 14:34:17,2021-08-02 17:29:34,2021-08-02 20:24:50,...,2022-07-31 16:49:50,2022-07-31 19:45:06,2022-07-31 22:40:23,2022-08-01 01:35:40,2022-08-01 04:30:56,2022-08-01 07:26:13,2022-08-01 10:21:30,2022-08-01 13:16:47,2022-08-01 16:12:03,2022-08-01 19:07:20

In [52]:
df.axes

[RangeIndex(start=0, stop=3000, step=1),
 Index(['CATEGORIA', 'VALOR', 'VALOR 2', 'Date&Time'], dtype='object')]

In [53]:
df.dtypes

CATEGORIA            object
VALOR               float64
VALOR 2             float64
Date&Time    datetime64[ns]
dtype: object

In [54]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3000 entries, 0 to 2999
Data columns (total 4 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   CATEGORIA  3000 non-null   object
 1   VALOR      2995 non-null   float64
 2   VALOR 2    2993 non-null   float64
 3   Date&Time  2999 non-null   datetime64[ns]
dtypes: datetime64[ns](1), float64(2), object(1)
memory usage: 93.9+ KB

In [57]:
df.empty

False

In [56]:
df.rank()

      CATEGORIA   VALOR  VALOR 2  Date&Time
0        2039.0  2570.5   2571.0        1.0
1         172.5  1211.0   1189.5        2.0
2        2414.0  2476.5   2484.0        3.0
3         519.0   841.5    842.0        4.0
4        1259.5     7.0      6.5        5.0
...         ...     ...      ...        ...
2995     2805.5  1406.0   1417.0     2995.0
2996      172.5  2634.0   2626.0     2996.0
2997     1657.5   211.0    206.0     2997.0
2998      879.0    66.0     59.0     2998.0
2999      172.5  1972.5   1969.5     2999.0

[3000 rows x 4 columns]

In [58]:
i=df.ndim

In [59]:
i

2

In [60]:
df.shape

(3000, 4)

In [61]:
df.size

12000

In [62]:
df.values

array([['Item4', 87.0, 87.09, Timestamp('2021-08-01 18:07:20')],
       ['Item', 46.0, 45.58, Timestamp('2021-08-01 21:02:37')],
       ['Item5', 84.0, 84.28, Timestamp('2021-08-01 23:57:53')],
       ...,
       ['Item3', 16.0, 15.7, Timestamp('2022-08-01 13:16:47')],
       ['Item1', 12.0, 11.84, Timestamp('2022-08-01 16:12:03')],
       ['Item', 69.0, 69.04, Timestamp('2022-08-01 19:07:20')]],
      dtype=object)

In [63]:
df.value_counts

<bound method DataFrame.value_counts of      CATEGORIA  VALOR  VALOR 2           Date&Time
0        Item4   87.0    87.09 2021-08-01 18:07:20
1         Item   46.0    45.58 2021-08-01 21:02:37
2        Item5   84.0    84.28 2021-08-01 23:57:53
3        Item0   35.0    35.04 2021-08-02 02:53:10
4        Item2   10.0    10.25 2021-08-02 05:48:27
...        ...    ...      ...                 ...
2995     Item6   52.0    52.22 2022-08-01 07:26:13
2996      Item   89.0    88.94 2022-08-01 10:21:30
2997     Item3   16.0    15.70 2022-08-01 13:16:47
2998     Item1   12.0    11.84 2022-08-01 16:12:03
2999      Item   69.0    69.04 2022-08-01 19:07:20

[3000 rows x 4 columns]>

In [66]:


df.rank()

      CATEGORIA   VALOR  VALOR 2  Date&Time
0        2039.0  2570.5   2571.0        1.0
1         172.5  1211.0   1189.5        2.0
2        2414.0  2476.5   2484.0        3.0
3         519.0   841.5    842.0        4.0
4        1259.5     7.0      6.5        5.0
...         ...     ...      ...        ...
2995     2805.5  1406.0   1417.0     2995.0
2996      172.5  2634.0   2626.0     2996.0
2997     1657.5   211.0    206.0     2997.0
2998      879.0    66.0     59.0     2998.0
2999      172.5  1972.5   1969.5     2999.0

[3000 rows x 4 columns]

In [71]:
df.sort_values(by=['VALOR 2','VALOR'], ascending=False)

     CATEGORIA  VALOR  VALOR 2           Date&Time
1734     Item2  100.0    99.97 2022-02-28 19:40:07
2325     Item0  100.0    99.96 2022-05-11 18:09:40
2602     Item1  100.0    99.93 2022-06-14 11:21:48
289      Item3  100.0    99.92 2021-09-05 22:22:48
2359     Item0  100.0    99.92 2022-05-15 21:29:08
...        ...    ...      ...                 ...
747      Item4   79.0      NaN 2021-10-31 16:20:19
511      Item0   55.0      NaN 2021-10-02 22:54:37
424      Item3   20.0      NaN 2021-09-22 08:45:23
834      Item3    NaN      NaN 2021-11-11 06:29:32
861       Item    NaN      NaN 2021-11-14 13:22:03

[3000 rows x 4 columns]

In [77]:
df.sort_index(axis=1, ascending=False)

      VALOR 2  VALOR           Date&Time CATEGORIA
0       87.09   87.0 2021-08-01 18:07:20     Item4
1       45.58   46.0 2021-08-01 21:02:37      Item
2       84.28   84.0 2021-08-01 23:57:53     Item5
3       35.04   35.0 2021-08-02 02:53:10     Item0
4       10.25   10.0 2021-08-02 05:48:27     Item2
...       ...    ...                 ...       ...
2995    52.22   52.0 2022-08-01 07:26:13     Item6
2996    88.94   89.0 2022-08-01 10:21:30      Item
2997    15.70   16.0 2022-08-01 13:16:47     Item3
2998    11.84   12.0 2022-08-01 16:12:03     Item1
2999    69.04   69.0 2022-08-01 19:07:20      Item

[3000 rows x 4 columns]

In [80]:
df.astype(str).info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3000 entries, 0 to 2999
Data columns (total 4 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   CATEGORIA  3000 non-null   object
 1   VALOR      3000 non-null   object
 2   VALOR 2    3000 non-null   object
 3   Date&Time  3000 non-null   object
dtypes: object(4)
memory usage: 93.9+ KB

In [81]:
df.iteritems

<bound method DataFrame.iteritems of      CATEGORIA  VALOR  VALOR 2           Date&Time
0        Item4   87.0    87.09 2021-08-01 18:07:20
1         Item   46.0    45.58 2021-08-01 21:02:37
2        Item5   84.0    84.28 2021-08-01 23:57:53
3        Item0   35.0    35.04 2021-08-02 02:53:10
4        Item2   10.0    10.25 2021-08-02 05:48:27
...        ...    ...      ...                 ...
2995     Item6   52.0    52.22 2022-08-01 07:26:13
2996      Item   89.0    88.94 2022-08-01 10:21:30
2997     Item3   16.0    15.70 2022-08-01 13:16:47
2998     Item1   12.0    11.84 2022-08-01 16:12:03
2999      Item   69.0    69.04 2022-08-01 19:07:20

[3000 rows x 4 columns]>

In [82]:
df.iterrows

<bound method DataFrame.iterrows of      CATEGORIA  VALOR  VALOR 2           Date&Time
0        Item4   87.0    87.09 2021-08-01 18:07:20
1         Item   46.0    45.58 2021-08-01 21:02:37
2        Item5   84.0    84.28 2021-08-01 23:57:53
3        Item0   35.0    35.04 2021-08-02 02:53:10
4        Item2   10.0    10.25 2021-08-02 05:48:27
...        ...    ...      ...                 ...
2995     Item6   52.0    52.22 2022-08-01 07:26:13
2996      Item   89.0    88.94 2022-08-01 10:21:30
2997     Item3   16.0    15.70 2022-08-01 13:16:47
2998     Item1   12.0    11.84 2022-08-01 16:12:03
2999      Item   69.0    69.04 2022-08-01 19:07:20

[3000 rows x 4 columns]>

In [85]:
for (name,series)  in df.iteritems():
    print(name)
    print(series)

CATEGORIA
0       Item4
1        Item
2       Item5
3       Item0
4       Item2
        ...
2995    Item6
2996     Item
2997    Item3
2998    Item1
2999     Item
Name: CATEGORIA, Length: 3000, dtype: object
VALOR
0       87.0
1       46.0
2       84.0
3       35.0
4       10.0
        ...
2995    52.0
2996    89.0
2997    16.0
2998    12.0
2999    69.0
Name: VALOR, Length: 3000, dtype: float64
VALOR 2
0       87.09
1       45.58
2       84.28
3       35.04
4       10.25
        ...
2995    52.22
2996    88.94
2997    15.70
2998    11.84
2999    69.04
Name: VALOR 2, Length: 3000, dtype: float64
Date&Time
0      2021-08-01 18:07:20
1      2021-08-01 21:02:37
2      2021-08-01 23:57:53
3      2021-08-02 02:53:10
4      2021-08-02 05:48:27
               ...
2995   2022-08-01 07:26:13
2996   2022-08-01 10:21:30
2997   2022-08-01 13:16:47
2998   2022-08-01 16:12:03
2999   2022-08-01 19:07:20
Name: Date&Time, Length: 3000, dtype: datetime64[ns]

In [87]:
df.count()

CATEGORIA    3000
VALOR        2995
VALOR 2      2993
Date&Time    2999
dtype: int64